Connected Services/Elegiblidade/tissVerificaElegibilidade.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ans="http://www.ans.gov.br/padroes/tiss/schemas" xmlns:tns="http://www.ans.gov.br/tiss/ws/tipos/tissverificaelegibilidade/v30301" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" name="tissVerificaElegibilidade" targetNamespace="http://www.ans.gov.br/tiss/ws/tipos/tissverificaelegibilidade/v30301" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema xmlns="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap11-enc="http://schemas.xmlsoap.org/soap/encoding/">
      <xsd:import schemaLocation="tissWebServicesV3_03_01.xsd" namespace="http://www.ans.gov.br/padroes/tiss/schemas" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="tissVerificaElegibilidade_Request">
    <wsdl:part name="pedidoElegibilidade" element="ans:pedidoElegibilidadeWS" />
  </wsdl:message>
  <wsdl:message name="tissVerificaElegibilidade_Response">
    <wsdl:part name="respostaElegibilidade" element="ans:respostaElegibilidadeWS" />
  </wsdl:message>
  <wsdl:message name="tissFault">
    <wsdl:part name="tissFault" element="ans:tissFaultWS" />
  </wsdl:message>
  <wsdl:portType name="tissVerificaElegibilidade_PortType">
    <wsdl:operation name="tissVerificaElegibilidade_Operation">
      <wsdl:input message="tns:tissVerificaElegibilidade_Request" />
      <wsdl:output message="tns:tissVerificaElegibilidade_Response" />
      <wsdl:fault name="TissFault" message="tns:tissFault" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="tissVerificaElegibilidade_Binding" type="tns:tissVerificaElegibilidade_PortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="tissVerificaElegibilidade_Operation">
      <soap:operation soapAction="" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="TissFault">
        <soap:fault use="literal" name="TissFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="tissVerificaElegibilidade">
    <wsdl:port name="tissVerificaElegibilidade_Port" binding="tns:tissVerificaElegibilidade_Binding">
      <soap:address location="http://187.94.62.176:20807/tissVerificaElegibilidadeV3_03_01V3_03_01.apw" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>